spairot/M3H6_Blink/Libraries/CMSIS/TMPM3H4.h
/**
 *******************************************************************************
 * @file    TMPM3H4.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM3H4' Device Series
 * @version V1.0.6.0
 * $Date:: 2017-02-20 #$
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2017 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TXZ_MICROCONTROLLER
  * @{
  */
  
/** @addtogroup TMPM3H4
  * @{
  */

#ifndef __TMPM3H4_H__
#define __TMPM3H4_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
  NonMaskableInt_IRQn           = -14,       /*!< 2 Non Maskable Interrupt                                    */
  HardFault_IRQn                = -13,       /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
  MemoryManagement_IRQn         = -12,       /*!< 4 Cortex-M3 Memory Management Interrupt                     */
  BusFault_IRQn                 = -11,       /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
  UsageFault_IRQn               = -10,       /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
  SVCall_IRQn                   = -5,        /*!< 11 Cortex-M3 SV Call Interrupt                              */
  DebugMonitor_IRQn             = -4,        /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
  PendSV_IRQn                   = -2,        /*!< 14 Cortex-M3 Pend SV Interrupt                              */
  SysTick_IRQn                  = -1,        /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM3H4 Specific Interrupt Numbers *******************************************************************/
  INT00_IRQn                    = 0,         /*!< Interrupt Pin0                                              */
  INT01_IRQn                    = 1,         /*!< Interrupt Pin1                                              */
  INT02_IRQn                    = 2,         /*!< Interrupt Pin2                                              */
  INT03_IRQn                    = 3,         /*!< Interrupt Pin3                                              */
  INT04_IRQn                    = 4,         /*!< Interrupt Pin4                                              */
  INT05_IRQn                    = 5,         /*!< Interrupt Pin5                                              */
  INT06_IRQn                    = 6,         /*!< Interrupt Pin6                                              */
  INT07_IRQn                    = 7,         /*!< Interrupt Pin7                                              */
  INT08_IRQn                    = 8,         /*!< Interrupt Pin8                                              */
  INT09_IRQn                    = 9,         /*!< Interrupt Pin9                                              */
  INT10_IRQn                    = 10,        /*!< Interrupt Pin10                                             */
  INTEMG0_IRQn                  = 16,        /*!< PMD0 EMG interrupt                                          */
  INTOVV0_IRQn                  = 17,        /*!< PMD0 OVV interrupt                                          */
  INTPMD0_IRQn                  = 18,        /*!< PMD0 interrupt                                              */
  INTENC00_IRQn                 = 19,        /*!< Encoder 0 interrupt 0                                       */
  INTENC01_IRQn                 = 20,        /*!< Encoder 0 interrupt 1                                       */
  INTADAPDA_IRQn                = 21,        /*!< ADC conversion triggered by PMD is finished A               */
  INTADAPDB_IRQn                = 22,        /*!< ADC conversion triggered by PMD is finished B               */
  INTADACPA_IRQn                = 23,        /*!< ADC conversion monitoring function interrupt A              */
  INTADACPB_IRQn                = 24,        /*!< ADC conversion monitoring function interrupt B              */
  INTADATRG_IRQn                = 25,        /*!< ADC conversion triggered by General purpose is finished     */
  INTADASGL_IRQn                = 26,        /*!< ADC conversion triggered by Single program is finished      */
  INTADACNT_IRQn                = 27,        /*!< ADC conversion triggered by Continuity program is finished  */
  INTT0RX_IRQn                  = 28,        /*!< TSPI/SIO reception (channel 0)                              */
  INTT0TX_IRQn                  = 29,        /*!< TSPI/SIO transmit (channel 0)                               */
  INTT0ERR_IRQn                 = 30,        /*!< TSPI/SIO error (channel 0)                                  */
  INTT1RX_IRQn                  = 31,        /*!< TSPI/SIO reception (channel 1)                              */
  INTT1TX_IRQn                  = 32,        /*!< TSPI/SIO transmit (channel 1)                               */
  INTT1ERR_IRQn                 = 33,        /*!< TSPI/SIO error (channel 1)                                  */
  INTI2CWUP_IRQn                = 34,        /*!< Serial bus interface (WakeUp) interrupt (channel 0)         */
  INTI2C0_IRQn                  = 35,        /*!< I2C0 transmission and reception interrupt                   */
  INTI2C0AL_IRQn                = 36,        /*!< I2C0 arbitration lost interrupt                             */
  INTI2C0BF_IRQn                = 37,        /*!< I2C0 bus free interrupt                                     */
  INTI2C0NA_IRQn                = 38,        /*!< I2C0 no ack interrupt                                       */
  INTI2C1_IRQn                  = 39,        /*!< I2C1 transmission and reception interrupt                   */
  INTI2C1AL_IRQn                = 40,        /*!< I2C1 arbitration lost interrupt                             */
  INTI2C1BF_IRQn                = 41,        /*!< I2C1 bus free interrupt                                     */
  INTI2C1NA_IRQn                = 42,        /*!< I2C1 no ack interrupt                                       */
  INTI2C2_IRQn                  = 43,        /*!< I2C2 transmission and reception interrupt                   */
  INTI2C2AL_IRQn                = 44,        /*!< I2C2 arbitration lost interrupt                             */
  INTI2C2BF_IRQn                = 45,        /*!< I2C2 bus free interrupt                                     */
  INTI2C2NA_IRQn                = 46,        /*!< I2C2 no ack interrupt                                       */
  INTUART0RX_IRQn               = 47,        /*!< UART reception (channel 0)                                  */
  INTUART0TX_IRQn               = 48,        /*!< UART transmit (channel 0)                                   */
  INTUART0ERR_IRQn              = 49,        /*!< UART error (channel 0)                                      */
  INTUART1RX_IRQn               = 50,        /*!< UART reception (channel 1)                                  */
  INTUART1TX_IRQn               = 51,        /*!< UART transmit (channel 1)                                   */
  INTUART1ERR_IRQn              = 52,        /*!< UART error (channel 1)                                      */
  INTUART2RX_IRQn               = 53,        /*!< UART reception (channel 2)                                  */
  INTUART2TX_IRQn               = 54,        /*!< UART transmit (channel 2)                                   */
  INTUART2ERR_IRQn              = 55,        /*!< UART error (channel 2)                                      */
  INTT32A0A_IRQn                = 56,        /*!< 32bit T32A0A compare match detection 0 / Over flow / under flow*/
  INTT32A0ACAP0_IRQn            = 57,        /*!< 32bit T32A0A input capture 0                                */
  INTT32A0ACAP1_IRQn            = 58,        /*!< 32bit T32A0A input capture 1                                */
  INTT32A0B_IRQn                = 59,        /*!< 32bit T32A0B compare match detection 0 / Over flow / under flow*/
  INTT32A0BCAP0_IRQn            = 60,        /*!< 32bit T32A0B input capture 0                                */
  INTT32A0BCAP1_IRQn            = 61,        /*!< 32bit T32A0B input capture 1                                */
  INTT32A0C_IRQn                = 62,        /*!< 32bit T32A0C compare match detection 0 / Over flow / under flow*/
  INTT32A0CCAP0_IRQn            = 63,        /*!< 32bit T32A0C input capture 0                                */
  INTT32A0CCAP1_IRQn            = 64,        /*!< 32bit T32A0C input capture 1                                */
  INTT32A1A_IRQn                = 65,        /*!< 32bit T32A1A compare match detection 0 / Over flow / under flow*/
  INTT32A1ACAP0_IRQn            = 66,        /*!< 32bit T32A1A input capture 0                                */
  INTT32A1ACAP1_IRQn            = 67,        /*!< 32bit T32A1A input capture 1                                */
  INTT32A1B_IRQn                = 68,        /*!< 32bit T32A1B compare match detection 0 / Over flow / under flow*/
  INTT32A1BCAP0_IRQn            = 69,        /*!< 32bit T32A1B input capture 0                                */
  INTT32A1BCAP1_IRQn            = 70,        /*!< 32bit T32A1B input capture 1                                */
  INTT32A1C_IRQn                = 71,        /*!< 32bit T32A1C compare match detection 0 / Over flow / under flow*/
  INTT32A1CCAP0_IRQn            = 72,        /*!< 32bit T32A1C input capture 0                                */
  INTT32A1CCAP1_IRQn            = 73,        /*!< 32bit T32A1C input capture 1                                */
  INTT32A2A_IRQn                = 74,        /*!< 32bit T32A2A compare match detection 0 / Over flow / under flow*/
  INTT32A2ACAP0_IRQn            = 75,        /*!< 32bit T32A2A input capture 0                                */
  INTT32A2ACAP1_IRQn            = 76,        /*!< 32bit T32A2A input capture 1                                */
  INTT32A2B_IRQn                = 77,        /*!< 32bit T32A2B compare match detection 0 / Over flow / under flow*/
  INTT32A2BCAP0_IRQn            = 78,        /*!< 32bit T32A2B input capture 0                                */
  INTT32A2BCAP1_IRQn            = 79,        /*!< 32bit T32A2B input capture 1                                */
  INTT32A2C_IRQn                = 80,        /*!< 32bit T32A2C compare match detection 0 / Over flow / under flow*/
  INTT32A2CCAP0_IRQn            = 81,        /*!< 32bit T32A2C input capture 0                                */
  INTT32A2CCAP1_IRQn            = 82,        /*!< 32bit T32A2C input capture 1                                */
  INTT32A3A_IRQn                = 83,        /*!< 32bit T32A3A compare match detection 0 / Over flow / under flow*/
  INTT32A3ACAP0_IRQn            = 84,        /*!< 32bit T32A3A input capture 0                                */
  INTT32A3ACAP1_IRQn            = 85,        /*!< 32bit T32A3A input capture 1                                */
  INTT32A3B_IRQn                = 86,        /*!< 32bit T32A3B compare match detection 0 / Over flow / under flow*/
  INTT32A3BCAP0_IRQn            = 87,        /*!< 32bit T32A3B input capture 0                                */
  INTT32A3BCAP1_IRQn            = 88,        /*!< 32bit T32A3B input capture 1                                */
  INTT32A3C_IRQn                = 89,        /*!< 32bit T32A3C compare match detection 0 / Over flow / under flow*/
  INTT32A3CCAP0_IRQn            = 90,        /*!< 32bit T32A3C input capture 0                                */
  INTT32A3CCAP1_IRQn            = 91,        /*!< 32bit T32A3C input capture 1                                */
  INTT32A4A_IRQn                = 92,        /*!< 32bit T32A4A compare match detection 0 / Over flow / under flow*/
  INTT32A4ACAP0_IRQn            = 93,        /*!< 32bit T32A4A input capture 0                                */
  INTT32A4ACAP1_IRQn            = 94,        /*!< 32bit T32A4A input capture 1                                */
  INTT32A4B_IRQn                = 95,        /*!< 32bit T32A4B compare match detection 0 / Over flow / under flow*/
  INTT32A4BCAP0_IRQn            = 96,        /*!< 32bit T32A4B input capture 0                                */
  INTT32A4BCAP1_IRQn            = 97,        /*!< 32bit T32A4B input capture 1                                */
  INTT32A4C_IRQn                = 98,        /*!< 32bit T32A4C compare match detection 0 / Over flow / under flow*/
  INTT32A4CCAP0_IRQn            = 99,        /*!< 32bit T32A4C input capture 0                                */
  INTT32A4CCAP1_IRQn            = 100,       /*!< 32bit T32A4C input capture 1                                */
  INTT32A5A_IRQn                = 101,       /*!< 32bit T32A5A compare match detection 0 / Over flow / under flow*/
  INTT32A5ACAP0_IRQn            = 102,       /*!< 32bit T32A5A input capture 0                                */
  INTT32A5ACAP1_IRQn            = 103,       /*!< 32bit T32A5A input capture 1                                */
  INTT32A5B_IRQn                = 104,       /*!< 32bit T32A5B compare match detection 0 / Over flow / under flow*/
  INTT32A5BCAP0_IRQn            = 105,       /*!< 32bit T32A5B input capture 0                                */
  INTT32A5BCAP1_IRQn            = 106,       /*!< 32bit T32A5B input capture 1                                */
  INTT32A5C_IRQn                = 107,       /*!< 32bit T32A5C compare match detection 0 / Over flow / under flow*/
  INTT32A5CCAP0_IRQn            = 108,       /*!< 32bit T32A5C input capture 0                                */
  INTT32A5CCAP1_IRQn            = 109,       /*!< 32bit T32A5C input capture 1                                */
  INTDMAATC_IRQn                = 110,       /*!< DMA end of transfer                                         */
  INTDMAAERR_IRQn               = 111,       /*!< DMA transfer error                                          */
  INTRTC_IRQn                   = 112,       /*!< Real time clock(XHz) interrupt                              */
  INTRMC_IRQn                   = 114,       /*!< Remote control reception interrupt                          */
  INTFLCRDY_IRQn                = 115,       /*!< Code FLASH Ready interrupt                                  */
  INTFLDRDY_IRQn                = 116        /*!< Data FLASH Ready interrupt                                  */
} IRQn_Type;

